HCHogan/STM32-Template/Hardware/Timer.c
#include "stm32f10x.h"

#ifdef __cplusplus
extern "C"
{
#endif
uint16_t Num;
void Timer_Init(void) {
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);	// apb1 this time cuz tim2 is here
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	//	etc pin extern clock mode 2 
	TIM_ETRClockMode2Config(TIM2, TIM_ExtTRGPSC_OFF, TIM_ExtTRGPolarity_NonInverted, 0x00);
										// default
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;		// 滤波器采样的分频
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;			// 重复寄存器,只有高级寄存器用,普通寄存器设置了也没用
	TIM_TimeBaseInitStructure.TIM_Period = 10000 - 1;				// 自动重装寄存器
	TIM_TimeBaseInitStructure.TIM_Prescaler = 7200 - 1;				// 预分频
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);

	TIM_ClearFlag(TIM2, TIM_FLAG_Update);							// 清楚标志位,防止刚开机就进中断
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);						// 使能中断
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_Init(&NVIC_InitStructure);

	TIM_Cmd(TIM2, ENABLE);
}

uint16_t Timer_GetCounter(void) {
	return TIM_GetCounter(TIM2);
}

void TIM2_IRQHandler(void) {
	if(TIM_GetITStatus(TIM2, TIM_IT_Update) == SET) {				// 查看更新位
		Num++;
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
	}
}

#ifdef __cplusplus
}
#endif
